app/views/teams/_modal_add_members.html.erb

SELECT `teams`.* FROM `teams`
---
                  <% if @team.id.present? %>
                    <% @team.team_members.each do |developer| %>