app/views/chart/_line_chart_datewise_employees.html.erb

    <% value.each do |rating| %>
      <% if rating.rating_date.present? %>
---
SELECT ratings.rating_date as rating_date, total_rating, employees.name as emp_name FROM `ratings` right outer join employees on employees.id = ratings.employee_id WHERE ((rating_date >= '2014-04-18' and rating_date <= '2014-04-25') or rating_date is null) AND (employees.role_id != 1 and team_id = 12)  ORDER BY ratings.rating_date