app/views/chart/_overall_employee_impression.html.erb

      series:
      [
        <% i=0 %>
        <% @rating_details.each do |factor_name, values| %>
          {
            name: '<%= factor_name %>',
              <% tmp = []%>
              <% values.each do |v| %>
               <% tmp.push ((v.total_rating/total_count[i].to_f).round(2)) %>
              <% end %>
            data: <%= tmp %>
              <% i = i+1 %>
          },
        <% end %>
      ]
---
SELECT COUNT(*) AS count_all, employee_id AS employee_id FROM `ratings`  WHERE (rating_date  BETWEEN '2014-04-17' AND '2014-04-24' ) GROUP BY employee_id