app/views/chart/leaves_pie.html.erb

SELECT `leave_reason_categories`.* FROM `leave_reason_categories`
---
        <div class="my-select">
          <%= select_tag :reason_category, options_from_collection_for_select(LeaveReasonCategory.all,"id","name"), :id => "leave_reason_category_id_in_reports", :multiple => true %>