app/views/factors/_list_factors.html.erb

SELECT `factors`.* FROM `factors`
---
        <th>Show/hide</th><th> Factor Names</th><th>State</th><th colspan="2">Action</th>
        <% Factor.all.each do |factor| %>

SELECT `factor_guidlines`.* FROM `factor_guidlines`  WHERE `factor_guidlines`.`factor_id` = 1
---
              <th></th><th> Guidlines </th><th> Values </th><th> State </th><th colspan="2">Actions</th></tr>
              <% factor.factor_guidlines.each do |f| %>