app/views/ratings/_edit_mass_rating.html.erb

SELECT `employees`.* FROM `employees`  WHERE (role_id = 1) AND (id not in (6))
---
							<%= form_for rating, method: :put, :remote => true do |f| %>
								<td><h4><%= Employee.find(rating.employee_id).name %></h4>