app/views/leaves/_list_leaves.html.erb

                  <center>
                    <%= l.employee.name == current_user.name ? "me" : l.employee.name.split(" ").first %>
---
SELECT `employees`.* FROM `employees`  WHERE `employees`.`id` IN (6, 7, 9)