app/controllers/chart_controller.rb

SELECT  `employees`.* FROM `employees` INNER JOIN `teams` ON `teams`.`id` = `employees`.`team_id` WHERE (role_id = 1)  ORDER BY `employees`.`id` ASC LIMIT 1
SELECT employees.name as emp_name, factor_id, sum(rating_details.rating_value) as total_rating, ratings.employee_id as employee_id, factors.name as factor_name FROM `rating_details` inner join ratings on ratings.id = rating_details.rating_id inner join employees on employees.id = ratings.employee_id inner join factors on factors.id = rating_details.factor_id WHERE (ratings.rating_date >= '2014-04-17' and ratings.rating_date <= '2014-04-24' and team_id = 1) GROUP BY factor_id, ratings.employee_id
---
  def overall_employee_impression
    # employess factors rating value grouped
      @rating_details = RatingDetail.joins("inner join ratings on ratings.id = rating_details.rating_id inner join employees on employees.id = ratings.employee_id inner join factors on factors.id = rating_details.factor_id").
                      where("ratings.rating_date >= ? and ratings.rating_date <= ? and team_id = ?",@start_date,@end_date,@project_manager.team_id).
                      select("employees.name as emp_name, factor_id, sum(rating_details.rating_value) as total_rating, ratings.employee_id as employee_id, factors.name as factor_name").
                      group("factor_id, ratings.employee_id").
                      group_by(&:factor_name)

SELECT `leave_reason_categories`.* FROM `leave_reason_categories`  WHERE `leave_reason_categories`.`id` IN (1, 2, 3)
SELECT `employees`.`id` FROM `employees`
SELECT `employees`.`id` FROM `employees`  WHERE `employees`.`team_id` = 10 AND (employees.role_id = 2)
SELECT `teams`.* FROM `teams`
SELECT `employees`.`name`, `employees`.`id` FROM `employees`  WHERE (team_id IS NULL)
---
  def leaves_pie
    @status = params[:status].present? ? params[:status] : [0,1]
    @reason_category = params[:reason_category].present? ? LeaveReasonCategory.where(id: params[:reason_category]) : LeaveReasonCategory.all
    @startDate = params[:startdate].present? ? params[:startdate] : Date.today
    @endDate = params[:enddate].present? ? params[:enddate] : Date.today + 30
    if current_user.employee?
      @employees = current_user.id
    else
      @employees = params[:employees].present? ? params[:employees] : Employee.all.pluck("id")
      @all_employees = Hash.new
      Team.all.each do |team|
        if team.team_members.present?
          if team.project_manager.admin?
            @all_employees[team.name] = team.team_members.pluck("name,id")
          else
            @all_employees[team.name] = team.team_members_with_project_manager.pluck("name,id")
          end
        end
      end
      @all_employees["Unallocated"] = Employee.unallocated_members.pluck("name","id")