app/controllers/dashboard_controller.rb

SELECT `employees`.* FROM `employees`  WHERE ((extract(month from birthdate) BETWEEN 4 AND 5) AND (extract(day from birthdate) BETWEEN 24 AND 1))
---
  def index
    notification_for_rating
    @notification_employees = Employee.where(id: @to_be_notified_to_admin) if @to_be_notified_to_admin.present?

SELECT `leaves`.* FROM `leaves`  WHERE `leaves`.`status` = 0
SELECT  `teams`.* FROM `teams`  WHERE `teams`.`id` = 10 LIMIT 1
SELECT `leaves`.* FROM `leaves`  WHERE `leaves`.`status` = 0 AND `leaves`.`employee_id` IN (7, 14, 15, 18, 21, 6)
SELECT `leaves`.* FROM `leaves`  WHERE `leaves`.`employee_id` IN (7, 14, 15, 18, 21)
---
  def dashboard_events
    google_events = []
    data = JSON.parse(Net::HTTP.get(URI.parse("https://www.googleapis.com/calendar/v3/calendars/#{current_user.email}/events?access_token=#{current_user.auth_token}")))
    data["items"].each do |item|
      google_events << {:id => item["id"], :title => item["summary"], :description => "Test", :start => "#{item["start"]["dateTime"].present? ? (item["start"]["dateTime"]).to_date.to_s : (item["start"]["date"]).to_date.to_s}", :end => "#{item["end"]["dateTime"].present? ? (item["end"]["dateTime"]).to_date.to_s : (item["end"]["date"]).to_date.to_s}", :backgroundColor => 'purple', :borderColor => 'purple'}
    end
    if current_user.admin?
      @leaves = Leave.where(status: Leave::STATUS.index("Sanctioned"))
    elsif current_user.project_manager? && current_user.team.present? && current_user.team.team_members.present?
      employee_ids = current_user.team.team_members.pluck("id")
      employee_ids << current_user.id
      @leaves = Leave.where(status: Leave::STATUS.index("Sanctioned"),employee_id: employee_ids)
    else
      @leaves = Leave.where(status: Leave::STATUS.index("Sanctioned"),employee_id: current_user.id)
    end
    upcomming_birthdays
    events = []
    @leaves.each do |leave|