app/controllers/employee_controller.rb

SELECT `employees`.`id` FROM `employees`  WHERE `employees`.`active` = 0
SELECT `ratings`.`employee_id`, `ratings`.`total_rating` FROM `ratings`  WHERE (rating_date between ('2014-04-17') AND ('2014-04-24') AND employee_id NOT IN (NULL))
SELECT `employees`.* FROM `employees`  WHERE (active = true and team_id = 1 AND id != (2))
---
  def index
    @ratings = Hash[Rating.where("rating_date between (?) AND (?) AND employee_id NOT IN (?)",(Date.today - 7),Date.today,Employee.where(active: false).pluck(:id)).select("employee_id, (total_rating)").pluck(:employee_id,:total_rating).group_by(&:first).map{ |k,a| [k,a.map(&:last)] }]
    if current_user.admin? || current_user.project_manager?
      if !(params.keys.first == "action")
        if params[:active].present?
          @employee =  Employee.where("#{params.keys.first} = #{params.values.first} ")