app/controllers/factors_controller.rb

SELECT `factor_guidlines`.* FROM `factor_guidlines`  WHERE `factor_guidlines`.`factor_id` = 1
SELECT `factors`.* FROM `factors`
---
	def new
		@factor = Factor.new
    @factor.factor_guidlines.build unless @factor.factor_guidlines.present?

INSERT INTO `factors` (`created_at`, `name`, `slug`, `updated_at`) VALUES ('2014-04-24 08:08:23', 'Working Hours', 'working-hours', '2014-04-24 08:08:23')
---
	def create
   	@factor = Factor.new(factor_params)
		if @factor.save

UPDATE `factors` SET `name` = 'Working Hours', `slug` = 'working-hours', `updated_at` = '2014-04-25 15:04:32' WHERE `factors`.`id` = 2
---
	def update
		@factor = Factor.friendly.find(params[:id])
		if @factor.update_attributes(factor_params)