app/controllers/leaves_controller.rb

  def set_leave
    @leave = Leave.find(params[:id])
---
SELECT `leaves`.* FROM `leaves`  WHERE (date_of_application  BETWEEN '2014-03-26' AND '2014-04-25' ) AND (status != 2) AND (employee_id = 6)