app/views/reports/index.html.erb

SELECT `factors`.* FROM `factors`
---
          <div class="my-select">
            <%= select_tag :factor_id, options_from_collection_for_select(Factor.all, "id", "name"), :id => "factor_id_reports", :multiple => true %>